[
  {
    "type": "tech",
    "id": "tech-1",
    "author": "나재은",
    "img": "https://static.toss.im/ml-illust/_20231108_104549157.png",
    "title": "null 리턴은 왜 나쁠까?",
    "desc": "코드 복잡성 관리 측면에서 의미를 축약한 표현의 문제와 해결 방법을 예제로 알아봐요.",
    "date": "2023. 11. 8",
    "content": "개발자의 고객은 누구라고 생각하시나요? 우리 제품을 사용하는 사용자(End-user)죠. 그런데 또 다른 고객이 있어요. 컴파일 타임의 고객, 바로 동료 개발자입니다. 복잡하고 나쁜 코드는 사용자 고객에게는 버그와 장애를, 개발자 고객에게는 낮은 생산성을 줍니다. 이번 시리즈에서는 사용자 고객뿐 아니라 개발자 고객을 위한 코드 복잡성 관리에 대해 이야기해 볼게요."
  },
  {
    "type": "tech",
    "id": "tech-2",
    "author": "임재후/최수민",
    "img": "https://static.toss.im/assets/payments/contents/engineering_thumb.jpg",
    "title": "웹에서 복잡한 퍼널 쉽게 관리하기",
    "desc": "토스페이먼츠 프론트엔드 챕터에서 웹에서 퍼널을 손쉽게 관리하기 위해 했던 고민과 해결 방법을 공유해요.",
    "date": "2023. 10. 18",
    "content": "토스 제품 디자인 원칙(PP: Product Principle)엔 “One thing for One Page”라는 원칙이 있어요. 화면 하나에는 명확한 목표 하나만 있어야 한다는 건데요. 이 원칙에 따라 제품을 만들다 보면 ‘퍼널’이 많이 생깁니다. 토스페이먼츠의 제품도 예외는 아니에요. 그래서 저희 프론트엔드 개발자들은 퍼널의 흐름을 잘 관리해야 하죠. 퍼널이란 사용자가 웹사이트를나 애플리케이션을 방문해서 최종 목표까지 달성하는데 거치는 단계를 뜻합니다. <br><br> 오늘은 토스페이먼츠의 프론트엔드 개발자들이 이 흐름을 어떻게 관리하고 있는지 소개하고, 이 방법의 좋은 점과 아쉬운 지점까지 공유해 볼게요."
  },
  {
    "type": "tech",
    "id": "tech-3",
    "author": "김동석",
    "img": "https://static.toss.im/career-resource/techblog_slash23_thumb_06_김동석.png",
    "title": "유연하고 안전하게 배포 Pipeline 운영하기",
    "desc": "생산성, 안정성, 보안성을 모두 달성하기 위해선 ‘Pipeline’을 어떻게 설정해야 할까요? 다양하고 복잡한 토스뱅크의 배포 ‘Pipeline’를 안전하게 운영하기 위한 노력을 소개합니다.",
    "date": "2023. 10. 12",
    "content": "토스뱅크에는 400개가 넘는 배포 Pipeline 이 있습니다. Pipeline의 개수가 많아지고, 종류가 다양해지고, 동작이 복잡해지며 여러 어려움이 생기는데요. 토스뱅크에서 Pipeline을 유연하고 안전하게 운영하기 위해 노력한 이야기를 소개해 보려 합니다.<br><br>Pipeline이란?<br><br>반복하는 일을 자동화하는 시스템을 말합니다. 서버 프로그램을 빌드하고 배포하는 Pipeline 이 가장 대표적인데요. 라이브러리를 업로드하거나 운영 작업을 자동화하는 데에도 많이 활용합니다. Micro Service Architecture를 적극적으로 활용하는 토스뱅크에서는 하루에도 수십~수백 번 서버를 배포하기 때문에, Pipeline 은 동료 개발자분들이 일상적으로 가장 많이 사용하는 시스템 중 하나입니다."
  },
  {
    "type": "tech",
    "id": "tech-4",
    "author": "최준우",
    "img": "https://static.toss.im/career-resource/techblog_slash23_thumb_05_최준우.png",
    "title": "토스는 Gateway 이렇게 씁니다",
    "desc": "더 안전하고 안정적인 서비스 운영을 위해서 ‘gateway’를 어떻게 사용해야 할까요? 토스의 수많은 마이크로서비스 로직을 공통화하기 위한 gateway 운영 방법에 대해 소개합니다.",
    "date": "2023. 10. 12",
    "content": "우선 Gateway에 대해 간단히 알아보겠습니다. Gateway는 라우팅 및 프로토콜 변환을 담당하며 마이크로 서비스의 중개자 역할을 하는 서버입니다. 이를 통해 서비스는 클라이언트와 독립적으로 확장할 수 있으며 보안, 모니터링을 위한 단일 제어 지점을 제공합니다. Netflix Zuul을 통해 잘 알려졌으며 현재는 Saas나 플랫폼으로도 사용할 수 있게 대중화되었습니다.<br><br>그림을 통해 예를 들어 보겠습니다. 서비스가 적고 트래픽이 적다면 클라이언트에서 서비스를 직접 호출하고 각각의 서비스에서 모든 로직을 처리해도 큰 부담이 되지는 않습니다. 그러나 스케일이 커지면 공통의 로직을 모든 서버에 적용하고 배포하는 것도 큰일이 됩니다."
  },
  {
    "type": "design",
    "id": "design-1",
    "author": "임경우",
    "img": "https://static.toss.im/simplicity23/graphics/sim23-signup-cover.png",
    "title": "완성 없는 이야기, 가입 과정 개선",
    "desc": "가입 완료율을 높이기 위해 고민하고 시도했던 것들을 이야기 해요.",
    "date": "2023. 9. 12",
    "content": "제품 성장 과정에 따라 적절한 UX가 다를 수 있다는 사실, 알고 계셨나요? 토스의 가입 과정은 테크 블로그에 첫 번째로 소개되었을 만큼 잘 만들었다고 자부하고 있었는데, 데이터를 확인해 보니 가입 완료율이 생각보다 낮았어요.<br><br>토스가 성장하면서 가입하는 주요 연령대가 바뀌었기 때문이에요. 가입 유저의 대부분이 2030이었을 때는 가입 완료율이 높았지만, 시니어 유저들이 주 가입층이 되니 가입 완료율이 낮아졌어요. 이번 글에서는 가입 완료율을 높이기 위해 고민하고 시도했던 것들을 이야기할게요."
  },
  {
    "type": "design",
    "id": "design-2",
    "author": "박연주/김지혜",
    "img": "https://static.toss.im/simplicity23/graphics/sim23-interaction-cover.png",
    "title": "인터랙션, 꼭 넣어야 해요?",
    "desc": "빠른 속도를 중요시하는 토스에서 어떻게 팀원들을 인터랙션에 공감하게 하고 슬릭한 제품을 만들어나갈 수 있었는지 소개할게요.",
    "date": "2023. 9. 7",
    "content": "제품을 인터랙티브하게 개선하면 경험이 더 좋아진다는 것은 모두 알지만, 인터랙션을 구현하는 비용 때문에 엄두가 나지 않기도 하는데요. 인터랙션 디자이너가 토스팀에 합류했을 때도 마찬가지였어요. 빠른 속도를 중요시하는 토스에서 어떻게 팀원들을 인터랙션에 대해 공감하게 하고 슬릭한 제품을 만들어나갈 수 있었는지 소개할게요."
  },
  {
    "type": "design",
    "id": "design-3",
    "author": "이지윤",
    "img": "https://static.toss.im/career-resource/sim23-mydoc-cover.png",
    "title": "크고 복잡한 제품, 과감하게 갈아엎기",
    "desc": "디자이너들도 어떻게 하면 빠른 속도를 내며 전체적인 경험을 맞출 수 있을지 매 순간 고민하고 있어요.",
    "date": "2023. 9. 3",
    "content": "빠른 속도를 위해 작은 실험을 중심으로 제품을 출시하고 개선하는 애자일 조직은 어떨까요? 사업과 제품의 끝그림을 처음부터 고려하고 있을까요? <br><br>토스는 어느덧 4개의 계열사, 100여 개 이상의 제품을 담고 있는 덩치 큰 앱이 되었어요. 한 팀에서 맡는 제품의 규모가 커지고 이해관계자도 점점 복잡해지고 있어요. 수많은 제품 간의 연결성을 이어주며 토스 앱을 구성하는 것이 중요한 일이 된 거죠. 이로 인해 디자이너들도 어떻게 하면 빠른 속도를 내며 전체적인 경험을 맞출 수 있을지 매 순간 고민하고 있어요. 오늘 제가 들려드릴 이야기는 과거 1년 전쯤 맡았던 ‘내 문서함’이라는 완성된 제품을 다시 쪼개버린 이야기예요. 한창 진행 중인 사업들과 오픈 예정인 서비스들을 뒤로하고 서비스를 갈아엎은 내용이죠. "
  },
  {
    "type": "design",
    "id": "design-4",
    "author": "심석용",
    "img": "https://static.toss.im/assets/toss-tech/sim23-uss.png",
    "title": "30대 디자이너가 10대 전용 카드를 만든다면?",
    "desc": "'요즘 10대는 어떤 카드를 좋아할까?', '30대인 내가 10대 친구들이 좋아하는 디자인을 할 수 있을까?' 청소년 전용 카드를 만들며 맞닥뜨렸던 혹독한 진실과, 그 과정에서 얻은 인사이트를 공유하고 싶어요.",
    "date": "2023. 8. 23",
    "content": "토스에는 어린이, 청소년 전용 카드가 있다는 거 알고 계셨나요? 출시된 지 1년 반도 지나지 않아 벌써 130만 장 넘게 발급되었어요. 토스 유스카드 (USS)라는 이름으로 세상에 나온 이 카드는 토스의 유저 중 틴즈 타겟, 즉 만 7세부터 만 16세까지만 이용이 가능한 충전식 선불카드인데요.<br><br>10대는 엄마 카드나 아빠 카드가 아닌, 본인의 이름이 새겨진 생애 최초의 카드 발급 경험이 대다수예요. 카드를 발급하고 사용하는 경험이 훨씬 특별하고 새롭게 다가올 유저인 거죠. <br><br>이런 모습을 상상하며 기획하고 디자인하는 과정들과, ‘30대 직장인인 내가 10대 친구들을 어떻게 이해할 수 있을까?’ 고민한 부분들에 대해 공유드릴게요."
  }
]
